#3/ нужно создать 3 фунции 1 регистрирует польз 2 производит логин 3 явля менеджером 

db = {'John': 23, 'Jack': 43, 'Alex': 23, 'Tom': 34}
# def creat():
#     # введите даные имя возраст
#     # польз добавлен
#     # выводит словарь с добавлен данн
#     global db 
#     name = input('ведите тия ')
#     age = int(input('ведит возр '))
#     if name in db:
#         print('пользователь уже существует')
#     else: 
#         db[name] = age
#         print('пользват успешно доюавлен')
#         print(f'на данный момент список польз такой: {db} ')
# def read():
#    print(f'на данный момент список польз такой: {db} ')
# read()
# def update():
#     global bd
#     name = input('кого вы хотите изменить ')
#     age = int(input('водите новый возраст'))
#     if name in db:
#         db[name] = age
#     print('польз успешно изменен')
#     print(f'список на данный момент: {db} ')